presentations/davidam-orgmode-presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Orgmode</title>
<!-- 2017-11-23 jue 22:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="David Arroyo Menéndez" />
<meta  name="description" content="Example of using org to create presentations using the beamer exporter"
 />
<meta  name="keywords" content="beamer org orgmode" />
</head>
<body>
<div id="content">
<h1 class="title">Orgmode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Features</a></li>
<li><a href="#sec-2">2. Todo Management</a></li>
<li><a href="#sec-3">3. Articles</a></li>
<li><a href="#sec-4">4. Spreadsheet</a></li>
<li><a href="#sec-5">5. Presentations</a></li>
<li><a href="#sec-6">6. Web Deployment</a></li>
<li><a href="#sec-7">7. My own orgmode extensions</a></li>
<li><a href="#sec-8">8. How I'm using orgmode</a></li>
<li><a href="#sec-9">9. Books translated to use and contribute</a></li>
<li><a href="#sec-10">10. Conclusions</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Features</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>TODO management in text mode
</li>
<li>Articles (reproducible research, latex capabilities, nice navigation, &#x2026;)
</li>
<li>Spreadsheet
</li>
<li>Presentation (beamer)
</li>
<li>Web Deployment
</li>
<li>Powerful hiperlinks (RMAIL, BBDB, IRC, &#x2026;)
</li>
<li>In general, easy to extend
</li>
<li>Ready to use in emacs, vim, github, &#x2026;
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Todo Management</h2>
<div class="outline-text-2" id="text-2">
</div><ol class="org-ol"><li><a id="sec-2-1" name="sec-2-1"></a>Todo management in text mode is useful to<br  /><div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Software projects with a limited number of developers (ej: sed)
</li>
<li>Share public agendas
</li>
<li>Manage your own time
</li>
<li>Acess by ssh to your agenda
</li>
</ul>
</div>
</li>

<li><a id="sec-2-2" name="sec-2-2"></a>Orgmode and gpg<br  /><div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>C-x C-f file.org.gpg
</li>
<li>C-x C-s
</li>
</ul>
</div>
</li>

<li><a id="sec-2-3" name="sec-2-3"></a>Orgmode and Android<br  /><div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>MobileOrg
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Articles</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Reproducible research
</li>
<li>Latex capabilities
</li>
<li>Nice navigation
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Spreadsheet</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Ascii text is a system accesible from ssh, easy to make diffs
</li>
<li>Lisp formulas
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Presentations</h2>
<div class="outline-text-2" id="text-5">
<p>
M-x org-beamer-export-to-pdf
evince davidam-orgmode-presentation.pdf
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Web Deployment</h2>
<div class="outline-text-2" id="text-6">
<p>
M-x org-html-export-to-html
firefox davidam-orgmode-presentation.html 
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> My own orgmode extensions</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>org-effectiveness.el
</li>
<li>org-license.el
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> How I'm using orgmode</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Presentations (sometimes)
</li>
<li>Personal agenda (not in all jobs)
</li>
<li>Personal web page
</li>
<li>Articles, tesis
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Books translated to use and contribute</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Guía Compacta de Orgmode
</li>
<li>Una introducción a la programación en emacs lisp
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Conclusions</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Orgmode is for gnu emacs, as gnu emacs is for the operating system.
</li>
<li>Orgmode is a format text full for any task in a desktop.
</li>
<li>Orgmode is a scientifics advance in this field.
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-11-23 Wed]</span></span></p>
<p class="author">Author: David Arroyo Menéndez</p>
<p class="date">Created: 2017-11-23 jue 22:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
